教育
["西安航空职业技术学院", "计算机网络（大专）", "2009～2012"]

专业技能
[
  "了解web标准，熟练开发PC端，移动端页面",
  "熟练html5、css3、javascript开发大型网站页面架构和布局",
  "熟练vue、vuex、vueRouter、jquery框架",
  "熟练git版本控制工具，进行代码管理，实现敏捷开发",
  "熟练调试工具，能够快速定位问题、处理bug",
  "了解http协议，ajax交互技术，jsonp，cors跨域问题",
  "了解es6特性、css预处理、webpack打包工具",
  "了解node，koa，mysql，linux后端开发技术"
]

工作经验
[
  {
    "company": "哈娄是一款多功能的交友约会APP——爱交友，上哈娄！哈娄App基于GPS全球定位技术，精准定位，出租时间，让时间有价可依，快速建立陌生人之间的友谊，不管是时间，地点，活动类型还是活动对象，用户都可以自由选择。",
    "job_time": "2014/05 - 2016/01",
    "content": [
      "在公司主要负责pc端，移动端页面，混合app开发",
      "1. 分析设计师提供的psd图，采用div+css技术完成页面布局",
      "2. 使用JavaScript，jquery实现页面的动态效果以及互动效果",
      "3. 测试页面兼容性问题，实现页面兼容主浏览器",
      "4. 修改bug，完成页面开发后交接后台，协助后台解决样式问题"
    ],
    "projects": [
      {
        "name": "哈娄app后台管理系统",
        "proj": "该系统功能，查看用户信息，设置上下架礼物，柱状图展示数据等的。",
        "duty": [
          "1. 主要负责礼物模块开发",
          "2. 增、删、改、查等业务逻辑",
          "3. bootstrap 开发, jquery实现业务逻辑"
        ]
      },
      {
        "name": "荷尔蒙网站移动端",
        "proj": "单屏页面，适配不同手机屏幕大小，播放视频。",
        "duty": [
          "1. 适配不同手机屏幕大小",
          "2. fullpage.js rem 实现单屏开发",
          "3. 滑到指定页播放视频文件",
          "4. 用谷歌浏览器进行调试"
        ]
      }
    ]
  },
  {
    "company": "换机精灵是杭州传信网络科技有限公司开发的一款手机内容迁移工具软件。本软件可以通过调用手机wifi自建热点，传输包括通讯录、通话记录、短信、音乐、视频、文档、图片、应用APK、系统设置九大类型的资料到目标手机，无需登录账户、添加好友，操作简单快捷。",
    "job_time": "2016/04 - 2017/03",
    "content": [
      "在公司主要负责pc端，移动端，混合app开发",
      "1.与设计团队、后端开发团队紧密配合，确保软件实施、优化网站前端性能",
      "2.充分理解项目需求，配合后台开发人员实现产品前端界面效果与功能",
      "3.负责移动产品HTML5、CSS3的编写，解决web端和移动端适配问题等",
      "4.实现产品UI和交互方面的开发需求，确保产品具有优质的用户使用体验"
    ],
    "projects": [
      {
        "name": "webview新闻页面",
        "time": "2016/08 - 2016/09",
        "proj": "新浪提供新闻池，前端调用接口展示新闻，接入第三方广告。",
        "duty": [
          "1. 和第三方对接，调用接口展示页面",
          "2. 插入合作广告位，设置埋点统计",
          "3. div、css 、rem布局页面，适配不同手机屏幕大小",
          "4. javascript实现页面交互，滚动加载，图片懒加载",
          "5. 用谷歌浏览器进行调试，解决不同手机展示问题"
        ]
      },
      {
        "name": "1折抢购",
        "time": "2016/04 - 2016/06",
        "proj": "1折抢购，一个全新的趣味性抢购平台免费参与抢购,就有机会0.1折买万元商品。",
        "duty": [
          "1. 使用FrozenUI 框架开发，Jquery实现页面效果",
          "2. 用谷歌浏览器进行调试，解决不同手机展示问题",
          "3. 前端优化：sprite图，添加公共部分，整理代码，完成页面优化"
        ]
      }
    ]
  },
  {
    "company": "好车主是专为用户提供专业实时的违章查询服务、代缴服务、违章推送、汽车改装以及技巧分享、资讯服务等功能的综合汽车APP。违章查询服务覆盖全国300多个城市，违章数据与交管局同步更新，保障数据的权威准确，为方便车主提供更好的违章办理服务。",
    "job_time": "2017/05 - 2016/06",
    "content": [
      "在公司主要负责混合app开发",
      "1、参与公司项目web前端研发工作，参与各项目开发环节，提供前端解决方案",
      "2.负责公司现有项目更新迭代，新项目的开发",
      "3.与开发团队进行充分的沟通，制定前端编程规范，开发创建性高，可用性高的网页",
      "4.负责开发符合W3C标准，兼容各个主流浏览器",
      "5.优化产品界面，为用户提供更好的体验"
    ],
    "projects": [
      {
        "name": "app主题页面",
        "time": "2017/5 - 2018/6",
        "proj": "活动页面，给用户参与，发放卡券福利，提升app活跃度",
        "duty": [
          "1.  基于vue框架，es6新语法进行编译，快速构建app活动页面",
          "2. 话题评论，图片点赞，分享朋友圈",
          "3. 基于vue开发封装共用插件、组件、过滤器",
          "4. 前后端分离开发，对axios封装成模块，统一调用获取数据",
          "5. 与客户端进行交互，下载app、唤醒app"
        ]
      }
    ]
  }
]

项目经验

[
  {
    "name": "app主题页面",
    "time": "2017/5 - 2018/6",
    "proj": "活动页面，给用户参与，发放卡券福利，提升app活跃度",
    "duty": [
      "1. 快速构建app活动页面",
      "2. 话题评论，图片点赞，分享朋友圈"
    ],
    "main": [
      "1. 基于vue框架，es6新语法进行编译",
      "2. 基于vue开发封装共用插件、组件、过滤器",
      "3. 前后端分离开发，对axios封装成模块，统一调用获取数据",
      "4. 与客户端进行交互，下载app、唤醒app",
      "5. 检查代码，测试兼容性，修复bug"
    ]
  },
  {
    "name": "webview新闻页面",
    "time": "2016/08 - 2016/09",
    "proj": "新浪提供新闻池，前端调用接口展示新闻，接入第三方广告。",
    "duty": [
      "1. 和第三方对接，调用接口展示页面",
      "2. 插入合作广告位，设置埋点统计",
      "3. 解决不同手机展示问题"
    ],
    "main": [
      "1. div、css 、rem布局页面，适配不同手机屏幕大小",
      "2. javascript实现页面交互，滚动加载，图片懒加载",
      "3. 进一步使用H5和CSS3进行页面效果优化",
      "4. 用谷歌浏览器进行调试"
    ]
  },
  {
    "name": "1折抢购",
    "time": "2016/04 - 2016/06",
    "proj": "1折抢购,一个全新的趣味性抢购平台免费参与抢购,就有机会0.1折买万元商品。",
    "duty": [
      "1. 主要负责部分页面布局，逻辑控制及效果的实现",
      "2. 解决不同手机展示问题"
    ],
    "main": [
      "1. 使用FrozenUI 框架开发，Jquery实现页面效果",
      "2. 用谷歌浏览器进行调试",
      "3. 前端优化：sprite图，添加公共部分，整理代码，完成页面优化"
    ]
  },
  {
    "name": "哈娄app后台管理系统",
    "time": "2014/11 - 2015/02",
    "proj": "该系统功能，查看用户信息，设置上下架礼物，柱状图展示数据等的。",
    "duty": [
      "1. 主要负责礼物模块开发",
      "2. 增、删、改、查等业务逻辑"
    ],
    "main": [
      "1. bootstrap 开发, jquery实现业务逻辑",
      "2. 总结并提交开发文档"
    ]
  },
  {
    "name": "荷尔蒙网站移动端",
    "time": "2014/07 - 2014/08",
    "proj": "单屏页面，适配不同手机屏幕大小，播放视频。",
    "duty": [
      "1. 适配不同手机屏幕大小",
      "2. 播放视频文件"
    ],
    "main": [
      "1. 按照psd文档内容切好图片，div+css布局",
      "2. fullpage.js rem 实现单屏开发",
      "3. 滑到指定页播放视频文件",
      "4. 用谷歌浏览器进行调试"
    ]
  }
]